"use client";

import Header from "@/app/_share/components/Header";
import { useRef } from "react";
import useScrollToggle from "../_share/hooks/useScrollToggle";
import { useLayoutUI } from "../components/LayoutUI";

export default function Home() {
    const mainRef = useRef<HTMLElement | null>(null);
    const isDown = useScrollToggle({ targetRef: mainRef });
    const { toggleHamburger, me } = useLayoutUI();
    return (
        <div>
            <Header toggleHamburger={toggleHamburger} me={me} isDown={isDown} />
            <main
                className="p-6 h-screen overflow-y-auto no-scrollbar "
                ref={mainRef}
            >
                <span>
                    あああああああああああああああああああああああああああああああああああああああ
                    あああああああああああああああああああああああああああああああああああああああああああああああああああああああ
                    ああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああ
                    ああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああ
                    ああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああ
                    ああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああ
                    ああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああ
                    ああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああ
                    あああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああ
                    ああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああ
                    ああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああ
                    あああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああ
                    ああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああ
                    ああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああ
                    あああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああ
                    あああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああ
                    あああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああ
                    あああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああ
                    あああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああ
                    あああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああ
                </span>
            </main>
        </div>
    );
}
