export default function Home() {
    return (
        <div className="p-6">
            <span>
                あああああああああああああああああああああああああああああああああああああああ
                あああああああああああああああああああああああああああああああああああああああああああああああああああああああ
                ああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああ
                ああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああ
                ああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああ
                ああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああ
                ああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああ
                ああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああ
                あああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああ
                ああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああ
                ああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああ
                あああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああ
                ああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああ
                ああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああ
                あああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああ
                あああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああ
                あああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああ
                あああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああ
                あああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああ
                あああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああ
            </span>
        </div>
    );
}
